app/views/trainings/new.html.erb

      <%= f.label :trainingcategory_id, "TrainingCategory" %>
      <%= f.collection_select :trainingcategory_id, Trainingcategory.all, :id, :name, :prompt => "選択して下さい" %>
      <%= f.label :bodypart_id, "BodyPart" %>
      <%= f.collection_select :bodypart_id, Bodypart.all, :id, :name, :prompt => "選択して下さい" %>
---
SELECT `trainingcategories`.* FROM `trainingcategories`
SELECT `bodyparts`.* FROM `bodyparts`