app/views/users/edit.html.erb

SELECT `authorities`.* FROM `authorities`
---
      <%= f.label :authority_id, "Authority" %>
      <%= f.collection_select :authority_id, Authority.all, :id, :name %>