app/views/users/show.html.erb

      <%= f.label :authority_id, "Authority" %>
      <%= f.collection_select :authority_id, Authority.all, :id, :name, disabled: true %>
---
SELECT `authorities`.* FROM `authorities`