app/controllers/authorities_controller.rb

  def index
    @authorities = Authority.all
---
SELECT `authorities`.* FROM `authorities`

  def edit
    @authority = Authority.find(params[:id])
---
SELECT `authorities`.* FROM `authorities` WHERE `authorities`.`id` = 1 LIMIT 1