app/controllers/bodyparts_controller.rb

SELECT `bodyparts`.* FROM `bodyparts`
---
  def index
    @bodyparts = Bodypart.all

INSERT INTO `bodyparts` (`name`, `image`, `created_at`, `updated_at`) VALUES ('hand', 'unknown.jpg', '2020-12-25 01:44:54.549311', '2020-12-25 01:44:54.549311')
---
  def create
    @bodypart = Bodypart.new(
      name: params[:bodypart][:name],
      image: 'unknown.jpg'
    )
    if @bodypart.save

SELECT `bodyparts`.* FROM `bodyparts` WHERE `bodyparts`.`id` = NULL LIMIT 1
---
  def edit
    @bodypart = Bodypart.find(params[:id])

SELECT `bodyparts`.* FROM `bodyparts` WHERE `bodyparts`.`id` = 1 LIMIT 1
---
  def show
    @bodypart = Bodypart.find(params[:id])

SELECT `bodyparts`.* FROM `bodyparts` WHERE `bodyparts`.`id` = 4 LIMIT 1
UPDATE `bodyparts` SET `bodyparts`.`name` = 'foot1', `bodyparts`.`updated_at` = '2020-12-26 04:09:16.084121' WHERE `bodyparts`.`id` = 4
---
  def update
    @bodypart = Bodypart.find(params[:id])
    @bodypart.name = params[:bodypart][:name]

    if @bodypart.save

SELECT `bodyparts`.* FROM `bodyparts` WHERE `bodyparts`.`id` = 3 LIMIT 1
DELETE FROM `bodyparts` WHERE `bodyparts`.`id` = 3
---
  def destroy
    @bodypart = Bodypart.find(params[:id])
    @bodypart.destroy