app/controllers/trainingmenus_controller.rb

  def index
    @trainingmenus = Trainingmenu.where(user_id: @current_user.id).order(name: :desc)
---
SELECT `trainingmenus`.* FROM `trainingmenus` WHERE `trainingmenus`.`user_id` = 1 ORDER BY `trainingmenus`.`name` DESC

  def create
    @trainingmenu = Trainingmenu.new(insert_trainingmenu_params)
    if @trainingmenu.save
---
INSERT INTO `trainingmenus` (`name`, `created_at`, `updated_at`, `user_id`) VALUES ('menu1', '2020-12-31 13:15:55.567407', '2020-12-31 13:15:55.567407', 1)

  def edit
    @trainingmenu = Trainingmenu.find(params[:id])
---
SELECT `trainingmenus`.* FROM `trainingmenus` WHERE `trainingmenus`.`id` = 7 LIMIT 1  [["id", 7], ["LIMIT", 1]]

  def show
    @trainingmenu = Trainingmenu.find(params[:id])
---
SELECT `trainingmenus`.* FROM `trainingmenus` WHERE `trainingmenus`.`id` = 7 LIMIT 1

  def update
    @trainingmenu = Trainingmenu.find(params[:id])
    @trainingmenu.name = params[:trainingmenu][:name]

    # unless params[:trainingmenu][:new_training_id] == ''
    #   @trainingmenu.trainingmenudetails.new(
    #     trainingmenu_id: @trainingmenu.id,
    #     training_id: params[:trainingmenu][:new_training_id],
    #     order: '1'
    #   )
    # end

    if @trainingmenu.update(update_trainingmenu_params)
---
SELECT `trainingmenus`.* FROM `trainingmenus` WHERE `trainingmenus`.`id` = 7 LIMIT 1  [["id", 7], ["LIMIT", 1]]
UPDATE `trainingmenus` SET `trainingmenus`.`name` = 'menu2', `trainingmenus`.`updated_at` = '2021-01-05 01:55:49.020197' WHERE `trainingmenus`.`id` = 3

  def destroy
    @trainingmenu = Trainingmenu.find(params[:id])
    @trainingmenu.destroy
---
SELECT `trainingmenus`.* FROM `trainingmenus` WHERE `trainingmenus`.`id` = 1 LIMIT 1
DELETE FROM `trainingmenus` WHERE `trainingmenus`.`id` = 2

  def ensure_correct_user
    @trainingmenu = Trainingmenu.find(params[:id])
---
SELECT `trainingmenus`.* FROM `trainingmenus` WHERE `trainingmenus`.`id` = 3 LIMIT 1