app/controllers/trainingmenus_controller.rb

SELECT `trainings`.* FROM `trainings` WHERE (`trainings`.`user_id` = 1 OR `trainings`.`user_id` IS NULL)
---
  def edit
    @trainingmenu = Trainingmenu.find(params[:id])
    @trainings = Training.where(user_id: @current_user.id).or(Training.where(user_id: nil))

SELECT `trainings`.* FROM `trainings` WHERE (`trainings`.`user_id` = 1 OR `trainings`.`user_id` IS NULL)
---
  def show
    @trainingmenu = Trainingmenu.find(params[:id])
    @trainings = Training.where(user_id: @current_user.id).or(Training.where(user_id: nil))