app/controllers/trainings_controller.rb

SELECT `trainings`.* FROM `trainings` WHERE `trainings`.`user_id` = 1
---
  def index
    @trainings = Training.where(user_id: @current_user.id)

INSERT INTO `trainings` (`name`, `explanation`, `url`, `time`, `created_at`, `updated_at`, `strength`, `user_id`) VALUES ('testtraining3', 'explanation', 'url', 10, '2020-12-26 05:43:43.311958', '2020-12-26 05:43:43.311958', 5, 1)
---
  def create
    @training = Training.new(
      name: params[:training][:name],
      explanation: params[:training][:explanation],
      image: nil,
      url: params[:training][:url],
      time: params[:training][:time],
      strength: params[:training][:strength],
      user_id: @current_user.id,
      trainingcategory_id: params[:training][:trainingcategory_id],
      bodypart_id: params[:training][:bodypart_id]
    )
    if @training.save

SELECT `trainings`.* FROM `trainings` WHERE `trainings`.`id` = 6 LIMIT 1  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @training = Training.find(params[:id])

SELECT `trainings`.* FROM `trainings` WHERE `trainings`.`id` = 3 LIMIT 1
---
  def show
    @training = Training.find(params[:id])

SELECT `trainings`.* FROM `trainings` WHERE `trainings`.`id` = 8 LIMIT 1  [["id", 8], ["LIMIT", 1]]
UPDATE `trainings` SET `trainings`.`time` = 10, `trainings`.`strength` = 6, `trainings`.`updated_at` = '2020-12-26 05:54:59.705290' WHERE `trainings`.`id` = 6
---
  def update
    @training = Training.find(params[:id])
    @training.name = params[:training][:name]
    @training.explanation = params[:training][:explanation]
    @training.url = params[:training][:url]
    @training.time = params[:training][:time]
    @training.strength = params[:training][:strength]
    @training.trainingcategory_id = params[:training][:trainingcategory_id]
    @training.bodypart_id = params[:training][:bodypart_id]

    if @training.save

SELECT `trainings`.* FROM `trainings` WHERE `trainings`.`id` = NULL LIMIT 1
DELETE FROM `trainings` WHERE `trainings`.`id` = 8
---
  def destroy
    @training = Training.find(params[:id])
    @training.destroy

SELECT `trainings`.* FROM `trainings` WHERE `trainings`.`id` = 6 LIMIT 1
---
  def ensure_correct_user
    @training = Training.find(params[:id])