app/controllers/trainingcategories_controller.rb

  def index
    @trainingcategories = Trainingcategory.all
---
SELECT `trainingcategories`.* FROM `trainingcategories`

  def create
    @trainingcategory = Trainingcategory.new(
      name: params[:trainingcategory][:name],
      image: 'unknown.jpg'
    )
    if @trainingcategory.save
---
INSERT INTO `trainingcategories` (`name`, `image`, `created_at`, `updated_at`) VALUES ('Strech', 'unknown.jpg', '2020-12-31 10:33:36.358276', '2020-12-31 10:33:36.358276')

  def edit
    @trainingcategory = Trainingcategory.find(params[:id])
---
SELECT `trainingcategories`.* FROM `trainingcategories` WHERE `trainingcategories`.`id` = 1 LIMIT 1

  def show
    @trainingcategory = Trainingcategory.find(params[:id])
---
SELECT `trainingcategories`.* FROM `trainingcategories` WHERE `trainingcategories`.`id` = 1 LIMIT 1