app/controllers/users_controller.rb

  def create
    if params[:user][:password] != params[:user][:password_confirmation]
      @error_message = 'パスワードが不一致です'
      render('users/new')
    end

    @user = User.new(
      name: params[:user][:name],
      password: params[:user][:password],
      authority_id: '1'
    )
    if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `password_digest`, `authority_id`) VALUES ('ttt', '2020-12-25 00:21:17.074362', '2020-12-25 00:21:17.074362', '$2a$12$eRn1cVeGU9egH8aTjZnY2eWamHeCYiLQ9pXfJTzPGUIo/zS7ssKBO', 1)

  def edit
    @user = User.find(params[:id])
    @authorities = Authority.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `authorities`.* FROM `authorities`

  def login
    @user = User.find_by(name: params[:name])
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'test' LIMIT 1