app/views/trainingmenus/new.html.erb

SELECT `trainings`.* FROM `trainings` WHERE (`trainings`.`user_id` = 1 OR `trainings`.`user_id` IS NULL)
---
      <%= f.fields_for :trainingmenudetails do |trainingmenudetail| %>
        <%= trainingmenudetail.collection_select :training_id, Training.where(user_id: @current_user.id).or(Training.where(user_id: nil)), :id, :name, include_blank: "選択して下さい" %>