app/views/trainingmenus/show.html.erb

      <%= f.fields_for :trainingmenudetails do |trainingmenudetail| %>
        <%= trainingmenudetail.collection_select :training_id, Training.where(user_id: @current_user.id).or(Training.where(user_id: nil)), :id, :name, {}, disabled: true %>
        <%= trainingmenudetail.number_field :order, in: 1..@trainingmenu.trainingmenudetails.count, step: 1, disabled: true %>
---
SELECT `trainings`.* FROM `trainings` WHERE (`trainings`.`user_id` = 1 OR `trainings`.`user_id` IS NULL)
SELECT `trainingmenudetails`.* FROM `trainingmenudetails` WHERE `trainingmenudetails`.`trainingmenu_id` = 3 ORDER BY `trainingmenudetails`.`order` DESC
SELECT COUNT(*) FROM `trainingmenudetails` WHERE `trainingmenudetails`.`trainingmenu_id` = 7